/******************************************************************************

Welcome to GDB Online.
GDB online is an online compiler and debugger tool for C, C++, Python, PHP, Ruby, 
C#, VB, Perl, Swift, Prolog, Javascript, Pascal, HTML, CSS, JS
Code, Compile, Run and Debug online from anywhere in world.

*******************************************************************************/

#include <stdio.h>
#include <limits.h> 
int main()
{
    Function1();
    return 0;
}
/*********************************************/
/* Function1   唐英傑 T094000082 2021/10/06  */
/*********************************************/
void Function1()
{
    int A =2;  
    int B =192;
    int C =0;
    C= A & B; //AND &
    //0000 0010
    //1100 0000
    //--------------
    //0000 0000  =0
    printf("A AND B = %d \r\n",C);
    C= A | B; //OR  |
    //0000 0010
    //1100 0000
    //--------------
    //1100 0010=194
    printf("A OR B = %d \r\n",C);
    C= A ^ B; //XOR  ^
    //0000 0010
    //1100 0000
    //--------------
    //1100 0010=194
    printf("A XOR B = %d \r\n",C);
    A=255;
    C= A ^ B; //XOR  ^
    //0000 0000 0000 0000 0000 0000 1111 1111
    //0000 0000 0000 0000 0000 0000 1100 0000
    //------------------------------------------
    //0000 0000 0000 0000 0000 0000 0011 1111=32+16+15=63
    printf("A XOR B = %d \r\n",C);
    //1100 0000 右移
    //-----------------
    //0110 0000
    C=B>>1;//右移運算 移動1個位元即除2
    printf("B右移個運算 = %d \r\n",C);
    //0000 0000 1100 0000 左移84
    C=B<<1;//左移運算 移動1個位元即乘2
    printf("B左移個運算 = %d \r\n",C);
    
    //-----------------
    //0000 0001 1000 0000 256+128=3
     printf("INT 最大值 = %d \r\n",INT_MAX);
}
